<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class QuestionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $questions = [
            // Intelligence Type ID: 1 (الذكاء الاجتماعي)
            ['text' => 'يأتيني الجيران أو الناس في العمل لأقدم لهم النصيحة.', 'intelligence_type_id' => 1],
            ['text' => 'أنا أمتلك ثلاثة أصدقاء مقربين على الأقل.', 'intelligence_type_id' => 1],
            ['text' => 'أنا أفضل التسلية الجماعية مثل لعبة المنوبولي أو ألعاب الفيديو الجماعية أو الورقة.', 'intelligence_type_id' => 1],
            ['text' => 'يسعدني تحدي تعليم الشخص أو مجموعة أشخاص ما أعرف عمله', 'intelligence_type_id' => 1],
            ['text' => 'أنا أعتبر نفسي قياديا ، أو هكذا يراني الآخرون.', 'intelligence_type_id' => 1],
            ['text' => 'أحب الانخراط في نشاطات اجتماعية متعلقة بعملي أو في دور العبادة أو المجتمع.', 'intelligence_type_id' => 1],
            ['text' => 'أفضل قضاء أمسياتي في حفل جماعي على أن أبقى وحيدا في البيت.', 'intelligence_type_id' => 1],
            ['text' => 'عندما تواجهني مشكلة أفضل البحث عن إنسان أخر ليساعدني أكثر من أن أحاول بنفسي حلها.', 'intelligence_type_id' => 1],

            // Intelligence Type ID: 2 (الذكاء البصري - الصوري)
            ['text' => 'أنا عادة أرى صورا واضحة عندما أغلق عيني.', 'intelligence_type_id' => 2],
            ['text' => 'أنا حساس للألوان.', 'intelligence_type_id' => 2],
            ['text' => 'أتمتع كثيرا بلعبة الصور المقطعة، والمتاهات، والألغاز الصورية.', 'intelligence_type_id' => 2],
            ['text' => 'أرى أحلاما تقترب من الواقع', 'intelligence_type_id' => 2],
            ['text' => 'أستطيع أن أجد طريقي في مناطق غير مألوفة.', 'intelligence_type_id' => 2],
            ['text' => 'أحب أن أرسم.', 'intelligence_type_id' => 2],
            ['text' => 'الهندسة عندي أسهل من الجبر ( أو الحساب).', 'intelligence_type_id' => 2],
            ['text' => 'يريحني أن أفكر كيف تبدو الأشياء إذا نظر إليها من الأعلى.', 'intelligence_type_id' => 2],

            // Intelligence Type ID: 3 (الذكاء الوجداني - الذاتي)
            ['text' => 'أنا عادة أقضي وقتا للتأمل والتفكير في أسئلة الحياة المهمة.', 'intelligence_type_id' => 3],
            ['text' => 'لدي بعض الأهداف في حياتي أفكر فيها باستمرار.', 'intelligence_type_id' => 3],
            ['text' => 'لدي اهتمامات وهوايات خاصة بي أحتفظ بها لنفسي.', 'intelligence_type_id' => 3],
            ['text' => 'لدي صورة واقعية عن مواطن قوتي ومواطن ضعفي حصلت عليها من التغذية الراجعة من مصادر أخرى.', 'intelligence_type_id' => 3],
            ['text' => 'أفضل أن أقضي إجازة نهاية الأسبوع وحدي من أن أقضيها مع الآخرون.', 'intelligence_type_id' => 3],
            ['text' => 'أنا أعتبر نفسي قوي الإرادة أو ذا عقلية مستقلة.', 'intelligence_type_id' => 3],
            ['text' => 'أنا أحتفظ بمذكرات شخصية أدون فيها أحداث حياتي الخاصة.', 'intelligence_type_id' => 3],
            ['text' => 'أنا صاحب مهنة حرة ، أو على الأقل أفكر جديا في البدء بمشروع حر.', 'intelligence_type_id' => 3],

            // Intelligence Type ID: 4 (الذكاء الجسدي - الحركي)
            ['text' => 'في الوضع العادي أشغل نفسي بنشاط رياضي واحد على الأقل.', 'intelligence_type_id' => 4],
            ['text' => 'أجد صعوبة في البقاء جالسا لفترة طويلة.', 'intelligence_type_id' => 4],
            ['text' => 'أفكاري المفضلة تأتيني عندما أكون في عملي أو أثناء المشي لمسافات طويلة ، أو وأنا مشغول ببعض الأنشطة البدنية.', 'intelligence_type_id' => 4],
            ['text' => 'أنا عادة أستخدم إشارات اليد أو أي حركات جسدية أثناء الحديث مع الآخرين.', 'intelligence_type_id' => 4],
            ['text' => 'أحتاج لتلمس الأشياء لأتعرف عليها أكثر.', 'intelligence_type_id' => 4],
            ['text' => 'أنا أحب أن أعمل في الأنشطة اليدوية', 'intelligence_type_id' => 4],
            ['text' => 'أنا أتمتع في ممارسة التسلية المتهورة مثل القيادة أي تجارب جسدية مثيرة.', 'intelligence_type_id' => 4],
            ['text' => 'أرغب في التدرب على مهارات جديدة أكثر من رغبتي في القراءة عنها أو مشاهدة فيلم فيديو يتحدث عنها.', 'intelligence_type_id' => 4],

            // Intelligence Type ID: 5 (الذكاء المنطقي)
            ['text' => 'أنا أستطيع الحساب في ذهني بسهولة.', 'intelligence_type_id' => 5],
            ['text' => 'الرياضيات و/ أو العلوم كانت من ضمن المواد المفضلة عندي في المدرسة.', 'intelligence_type_id' => 5],
            ['text' => 'أنا أحيانا أفكر في الأشياء المجردة والمفاهيم التخيلية.', 'intelligence_type_id' => 5],
            ['text' => 'أنا أكتشف أخطاء الناس في الأفعال والأقوال في عملهم أو في بيوتهم أو في مدارسهم.', 'intelligence_type_id' => 5],
            ['text' => 'أشعر بمزيد من الراحة عندما تقاس الأشياء وتصنف و تحلل وتعطى كميات معينة.', 'intelligence_type_id' => 5],
            ['text' => 'يسرني الانشغال بالألعاب الفكرية وحل المشكلات التي تتطلب تفكيرا منطقياً.', 'intelligence_type_id' => 5],
            ['text' => 'أحب طرح سؤال ماذا لو .... مثال : ماذا لو ضاعفت كمية المياه التي أعطيها للأزهار أسبوعياً ؟', 'intelligence_type_id' => 5],
            ['text' => 'أنا أعتقد أن لكل شيء تفسيراته المنطقية.', 'intelligence_type_id' => 5],

            // Intelligence Type ID: 6 (الذكاء الطبيعي)
            ['text' => 'أنا أحب جميع أنواع الحيوانات.', 'intelligence_type_id' => 6],
            ['text' => 'أتمتع كثيرا بصيد الأسماك والحيوانات والزراعة والطبخ.', 'intelligence_type_id' => 6],
            ['text' => 'أقوم بجمع الصخور والأصداف والحشرات مثل الفراشات والطوابع والبطاقات الرياضية وغيرها', 'intelligence_type_id' => 6],
            ['text' => 'أنا عادة أتفقد تقارير المناخ لتهيئة الظروف', 'intelligence_type_id' => 6],
            ['text' => 'أنا دائما أحب تنظيم أو تصنيف الأشياء في مجموعات متشابهة.', 'intelligence_type_id' => 6],
            ['text' => 'أنا أحب الطبيعة والتواجد خارجا ً', 'intelligence_type_id' => 6],
            ['text' => 'أنا كثيرا ما استخدم كميرا أو مسجل فيدو متنقل لتسجيل ما أشاهد حولي.', 'intelligence_type_id' => 6],
            ['text' => 'ألاحظ السمات الأساسية للكائنات بشكل عفوي', 'intelligence_type_id' => 6],

            // Intelligence Type ID: 7 (الذكاء اللغوي)
            ['text' => 'الكتب مهمة جدا بالنسبة لي', 'intelligence_type_id' => 7],
            ['text' => 'أنا أستطيع أن أفهم سماع الكلمات في ذهني قبل أن أكتبها أو أقرأها.', 'intelligence_type_id' => 7],
            ['text' => 'أستمتع بتسلية نفسي بألعاب التلاعب بالكلمات والقوافي غير المنطقية.', 'intelligence_type_id' => 7],
            ['text' => 'يضطر بعض الناس لسؤالي حول بعض معاني الكلمات في كتاباتي أو أحاديثي.', 'intelligence_type_id' => 7],
            ['text' => 'اللغة العربية والدراسات الاجتماعية والتاريخ كانت أسهل عندي أيام الدراسة من الرياضيات أو العلوم.', 'intelligence_type_id' => 7],
            ['text' => 'عندما أقود سيارتي في طريق سريع أهتم بقراءة الإعلانات أكثر من مشاهدة المناظر الجميلة.', 'intelligence_type_id' => 7],
            ['text' => 'في محادثاتي أكثر من ذكر بعض المراجع التي سمعتها أو قرأتها.', 'intelligence_type_id' => 7],
            ['text' => 'كتبت حديثا ما أثار انتباه الآخرين وجعلني أفتخر به وأنال الشهرة.', 'intelligence_type_id' => 7],

            // Intelligence Type ID: 8 (الذكاء الموسيقي)
            ['text' => 'أنا أملك صوتا جميلا.', 'intelligence_type_id' => 8],
            ['text' => 'أجد نفسي بعض الأحيان أمشي وتتردد في ذهني ألحان معينة.', 'intelligence_type_id' => 8],
            ['text' => 'من السهل أن أخصص وقتاً لسماع قطعة موسيقية باستخدام أدوات موسيقية بسيطة مثل الطبل والدف.', 'intelligence_type_id' => 8],
            ['text' => 'أنا أعزف على الآلات الموسيقية.', 'intelligence_type_id' => 8],
            ['text' => 'أنا أعرف النوتة لكثير من الأغاني والقطع الموسيقية', 'intelligence_type_id' => 8],
            ['text' => 'حياتي تكون تعيسة أن لم أستمع للموسيقى.', 'intelligence_type_id' => 8],
            ['text' => 'إذا استمعت إلى قطعة موسيقية مرة أو مرتين أستطيع ترديدها.', 'intelligence_type_id' => 8],
            ['text' => 'أنا غالبا ما أردد أو أنشئ بعض الألحان أثناء عملي أو مذاكرتي أو تعلمي لشيء جديد.', 'intelligence_type_id' => 8],
        ];

        DB::table('questions')->insert($questions);
    }
}